# Задание 1:
name = input('Как вас зовут? ')
print ('Здравствуйте, ' + name)
age = int(input('Сколько вам лет? '))
print(age)