# Задание 3:
number = int(input('Введите число: '))
num_2 =int(str(number)*2)
print(num_2)
num_3 =int(str(number)*3)
print(num_3)
result = number + num_2 + num_3
print('Сумма чисел равна ', result)